Wang-Zhitai/stm32-ultimate-demo/BSP/Inc/bsp_gt911_reg.h
#define GT911_GESTURE_SWITCH1_REG 0x8075U
#define GT911_GESTURE_SWITCH2_REG 0x8076U
#define GT911_GESTURE_SWITCH1_VAL 0x00U
#define GT911_GESTURE_SWITCH2_VAL 0x00U

#define GT911_GESTURE_REFRESH_REG 0x8077U

#define GT911_GESTURE_TH_REG 0x8078U

  /**
   * @}
   */

  /*******************************************************************************
   * Register      : Generic - All
   * Address       : Generic - All
   * Bit Group Name: None
   * Permission    : W
   *******************************************************************************/
  int32_t gt911_write_reg(gt911_ctx_t *pCtx, uint16_t reg, uint8_t *pData, uint16_t length);
  int32_t gt911_read_reg(gt911_ctx_t *pCtx, uint16_t reg, uint8_t *pData, uint16_t length);
/**************** Base Function  *******************/

/*******************************************************************************
 * Register      : DEV_MODE
 * Address       : 0X00
 * Bit Group Name: DEVICE_MODE
 * Permission    : RW
 *******************************************************************************/
#define GT911_DEV_MODE_BIT_MASK 0x70U
#define GT911_DEV_MODE_BIT_POSITION 4U
  int32_t gt911_dev_mode_w(gt911_ctx_t *pCtx, uint8_t value);
  int32_t gt911_dev_mode_r(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
 * Register      : GEST_ID
 * Address       : 0X01
 * Bit Group Name: Gesture ID
 * Permission    : R
 *******************************************************************************/
#define GT911_GEST_ID_BIT_MASK 0xFFU
#define GT911_GEST_ID_BIT_POSITION 0U
  int32_t gt911_gest_id(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
 * Register      : TD_STATUS
 * Address       : 0x814E
 * Bit Group Name:
 * Permission    : R
 *******************************************************************************/
// JCC adding START
#define GT911_TD_STATUS_BIT_BUFFER_STAT 0x80U
#define GT911_TD_STATUS_BIT_HAVEKEY 0x10U
#define GT911_TD_STATUS_BITS_NBTOUCHPTS 0x0FU
// JCC adding END
#define GT911_TD_STATUS_BIT_MASK 0x07U
#define GT911_TD_STATUS_BIT_POSITION 0U
  int32_t gt911_td_status(gt911_ctx_t *pCtx, uint8_t *pValue);

  int32_t gt911_clr_int(gt911_ctx_t *pCtx);

/*******************************************************************************
 * Register      : P1_XH
 * Address       : 0X03
 * Bit Group Name: First Event Flag
 * Permission    : R
 * Default value : 0xF0U
 *******************************************************************************/
#define GT911_P1_XH_EF_BIT_MASK 0xC0U
#define GT911_P1_XH_EF_BIT_POSITION 6U
  int32_t gt911_p1_xh_ef(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
 * Register      : P1_XL
 * Address       : 0x8150U
 * Bit Group Name: First Touch X Position
 * Permission    : R
 * Default value : 0x00U
 *******************************************************************************/
#define GT911_P1_XL_TP_BIT_MASK 0xFFU
#define GT911_P1_XL_TP_BIT_POSITION 0U
  int32_t gt911_p1_xl_tp(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
 * Register      : P1_XH
 * Address       : 0x8151U
 * Bit Group Name: First Touch X Position
 * Permission    : R
 * Default value : 0x00U
 *******************************************************************************/
#define GT911_P1_XH_TP_BIT_MASK 0x0FU
#define GT911_P1_XH_TP_BIT_POSITION 1U
  int32_t gt911_p1_xh_tp(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
 * Register      : P1_YL
 * Address       : 0x8152U
 * Bit Group Name: First Touch Y Position
 * Permission    : R
 * Default value : 0x00U
 *******************************************************************************/
#define GT911_P1_YL_TP_BIT_MASK 0xFFU
#define GT911_P1_YL_TP_BIT_POSITION 2U
  int32_t gt911_p1_yl_tp(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
 * Register      : P1_YH
 * Address       : 0x8153U
 * Bit Group Name: First Touch Y Position
 * Permission    : R
 * Default value : 0x00U
 *******************************************************************************/
#define GT911_P1_YH_TP_BIT_MASK 0x0FU
#define GT911_P1_YH_TP_BIT_POSITION 3U
  int32_t gt911_p1_yh_tp(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
 * Register      : P1_WEIGHT
 * Address       : 0x8154U
 * Bit Group Name: First Touch Weight(pressure)
 * Permission    : R
 * Default value : 0xFFFU
 *******************************************************************************/
#define GT911_P1_WEIGHT_BIT_MASK 0xFFFU
#define GT911_P1_WEIGHT_BIT_POSITION 4U
  int32_t gt911_p1_weight(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
 * Register      : P1_TID
 * Address       : 0x8157U
 * Bit Group Name: First Touch track-ID
 * Permission    : R
 * Default value : 0xFFU
 *******************************************************************************/
#define GT911_P1_TID_BIT_MASK 0xFFU
#define GT911_P1_TID_BIT_POSITION 7U
  int32_t gt911_p1_tid(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
 * Register      : P2_XH
 * Address       : 0X09
 * Bit Group Name: Second Event Flag
 * Permission    : R
 * Default value : 0xF0U
 *******************************************************************************/
#define GT911_P2_XH_EF_BIT_MASK 0xC0U
#define GT911_P2_XH_EF_BIT_POSITION 6U
  int32_t gt911_p2_xh_ef(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
 * Register      : P2_XH
 * Address       : 0X09
 * Bit Group Name: Second Touch X Position
 * Permission    : R
 * Default value : 0x0FU
 *******************************************************************************/
#define GT911_P2_XH_TP_BIT_MASK 0x0FU
#define GT911_P2_XH_TP_BIT_POSITION 8U
  int32_t gt911_p2_xh_tp(gt911_ctx_t *pCtx, uint8_t *pValue);

